rhoPimpleFoam_yplus1_omega98_3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (51.47188067851222 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    Inlet
    {
        type            pressureDirectedInletOutletVelocity;
        inletDirection uniform (1 0 0);
        value           $internalField;
    }

    Cyli
    {
        type            noSlip;
    }

    Botwall
    {
        type            movingWallVelocity;
        value           uniform $Uinlet;

    }

    Freestream
    {
        type            slip;
    }

    Side1
    {
        type            empty;
    }

    Side2
    {
        type            empty;
    }

    Outlet
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
