rhoPimpleFoam_yplus1_omega98_3/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega );


// ************************************************************************* //
